Revit 2027 API
BuiltInFailures.DPartFailures.PartsCannotBeCreatedFromInvalidGeom Property
 Post failure when attempts to create parts from invalid geometry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId PartsCannotBeCreatedFromInvalidGeom { get; }
Public Shared ReadOnly Property PartsCannotBeCreatedFromInvalidGeom As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ PartsCannotBeCreatedFromInvalidGeom {
	FailureDefinitionId^ get ();
}
static member PartsCannotBeCreatedFromInvalidGeom : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DPartFailures Class
Autodesk.Revit.DB Namespace